datomusic/duo-imxrt/brains2/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    /* 24th DWORD */
    /* dpd status */
    uint32_t dpd_status;

    /* 25th DWORD */
    /* udpd status */
    uint32_t udpd_status;

    /* 26th DWORD */
    /* output driver strength volatile */
    uint32_t output_driver_strength;

    /* 27th DWORD */
    /* output driver strength non-volatile */
    uint32_t output_driver_strength_nv;

    /* 28th DWORD */
    /* output driver strength control bit patterns */
    uint32_t output_driver_strength_bit_pattern;
} jedec_sccr_table_t;

/*! @brief Status, Control and Configuration Register Map for xSPI Profile 2.0 Memory Devices. */
typedef struct _jedec_sccr_2_table
{
    /* 1st DWORD */
    uint32_t volatile_reg_address_offset;

    /* 2nd DWORD */
    uint32_t non_volatile_reg_address_offset;

    /* 3rd DWORD */
    uint32_t cmd_status_control;

    /* 4th DWARD */
    uint32_t program_error;

    /* 5th DWARD */
    uint32_t erase_error;

    /* 6th DWARD */
    uint32_t dummy_cycle_setting_volatile;

    /* 7th DWARD */
    uint32_t dummy_cycle_setting_nv;

    /* 8th DWARD */
    uint32_t dummy_cycle_setting_bit_pattern1;

    /* 9th DWARD */
    uint32_t dummy_cycle_setting_bit_pattern2;

    /* 10th DWARD */
    uint32_t dummy_cycle_setting_bit_pattern3;

    /* 11th DWARD */
    uint32_t output_driver_strength_volatile;

    /* 12th DWARD */
    uint32_t output_driver_strength_nv;

    /* 13th DWARD */
    uint32_t output_driver_strength_bit_pattern;

} jedec_sccr_2_table_t;

/*! @brief Command Sequences to change to Octal DDR (8D-8D-8D) mode Instruction Table. */
typedef struct _jedec_octal_ddr_mode_inst_table
{
    /* 1st DWORD */
    struct
    {
        uint32_t byte_3_of_1st_command_seq : 8;
        uint32_t byte_2_of_1st_command_seq : 8;
        uint32_t byte_1_of_1st_command_seq : 8;
        uint32_t length_of_1st_command_seq : 8;
    } first_cmd_info_1st_dword;

    /* 2nd DWORD */
    struct
    {
        uint32_t byte_7_of_1st_command_seq : 8;
        uint32_t byte_6_of_1st_command_seq : 8;
        uint32_t byte_5_of_1st_command_seq : 8;
        uint32_t byte_4_of_1st_command_seq : 8;
    } first_cmd_info_2nd_dword;

    /* 3rd DWORD */
    struct
    {
        uint32_t byte_3_of_2nd_command_seq : 8;
        uint32_t byte_2_of_2nd_command_seq : 8;
        uint32_t byte_1_of_2nd_command_seq : 8;
        uint32_t length_of_2nd_command_seq : 8;
    } second_cmd_info_1st_dword;

    /* 4th DWORD */
    struct
    {
        uint32_t byte_7_of_2nd_command_seq : 8;
        uint32_t byte_6_of_2nd_command_seq : 8;
        uint32_t byte_5_of_2nd_command_seq : 8;
        uint32_t byte_4_of_2nd_command_seq : 8;
    } second_cmd_info_2nd_dword;

    /* 5th DWORD */
    struct
    {
        uint32_t byte_3_of_3rd_command_seq : 8;
        uint32_t byte_2_of_3rd_command_seq : 8;
        uint32_t byte_1_of_3rd_command_seq : 8;
        uint32_t length_of_3rd_command_seq : 8;
    } third_cmd_info_1st_dword;

    /* 6th DWORD */
    struct
    {
        uint32_t byte_7_of_3rd_command_seq : 8;
        uint32_t byte_6_of_3rd_command_seq : 8;
        uint32_t byte_5_of_3rd_command_seq : 8;
        uint32_t byte_4_of_3rd_command_seq : 8;
    } third_cmd_info_2nd_dword;

    /* 7th DWORD */
    struct
    {
        uint32_t byte_3_of_4th_command_seq : 8;
        uint32_t byte_2_of_4th_command_seq : 8;
        uint32_t byte_1_of_4th_command_seq : 8;
        uint32_t length_of_4th_command_seq : 8;
    } fouth_cmd_info_1st_dword;

    /* 8th DWORD */
    struct
    {
        uint32_t byte_7_of_4th_command_seq : 8;
        uint32_t byte_6_of_4th_command_seq : 8;
        uint32_t byte_5_of_4th_command_seq : 8;
        uint32_t byte_4_of_4th_command_seq : 8;
    } fouth_cmd_info_2nd_dword;
} jedec_octal_ddr_mode_cmd_table_t;

typedef struct _jdec_query_table
{
    uint32_t manufacturerId;
    uint32_t standard_version;
    uint32_t basic_flash_param_tbl_size;
    jedec_basic_flash_param_table_t basic_flash_param_tbl;
    bool has_4b_addressing_inst_table;
    jedec_4byte_addressing_inst_table_t flash_4b_inst_tbl;
    jedec_xspi_profile_1_table_t xspi_profile_1_tb1;
    jedec_sccr_table_t sccr_tb1;
    jedec_sccr_2_table_t sccr_2_tb1;
    jedec_octal_ddr_mode_cmd_table_t octal_ddr_cmd_tb1;
} jedec_info_table_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void FLEXSPI_NOR_Memset(void *src, uint8_t value, size_t length);

static status_t FLEXSPI_NOR_PrepareQuadModeEnableSequence(nor_handle_t *handle,
                                                          flexspi_mem_config_t *config,
                                                          jedec_info_table_t *tbl);
static status_t FLEXSPI_NOR_EnableQuadMode(nor_handle_t *handle, flexspi_mem_config_t *config, run_context_t *context);

static status_t FLEXSPI_NOR_ExitQuadMode(nor_handle_t *handle, flexspi_mem_config_t *config, jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_PreEnterOctalMode(nor_handle_t *handle,
                                              flexspi_mem_config_t *config,
                                              jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_MacronixEnterOctalMode(nor_handle_t *handle,
                                                   flexspi_mem_config_t *config,
                                                   jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_MacronixExitOctalMode(nor_handle_t *handle,
                                                  flexspi_mem_config_t *config,
                                                  jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_AdestoEnterOctalMode(nor_handle_t *handle,
                                                 flexspi_mem_config_t *config,
                                                 jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_ProbeCommandMode(nor_handle_t *handle, flexspi_mem_config_t *config);

static status_t FLEXSPI_NOR_CheckCommandModeAvailability(nor_handle_t *handle,
                                                         flexspi_mem_config_t *config,
                                                         jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_GenerateConfigBlockUsingSFDP(nor_handle_t *handle, flexspi_mem_config_t *config);

