datomusic/duo-imxrt/brains2/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
                /* Erase Block */
                /* Adesto Block(64KB) erase instruction is 0xD8, which aligned with SFDP erase information */
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_ERASEBLOCK] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, blockEraseCmd, addrInst, kFLEXSPI_8PAD, 0x20);

                /* Erase Chip */
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_CHIPERASE] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, kOctalSerialNorCmd_ChipErase_1st, kFLEXSPI_Command_STOP,
                                    kFLEXSPI_8PAD, 0x00);
            }
        }
    } while (false);

    return status;
}

static status_t FLEXSPI_NOR_PrepareQuadModeEnableSequence(nor_handle_t *handle,
                                                          flexspi_mem_config_t *config,
                                                          jedec_info_table_t *tbl)
{
    assert(handle != NULL);
    assert(config != NULL);
    assert(tbl != NULL);

    status_t status = kStatus_InvalidArgument;

    /* See JESD216A/B/C/D/D-01 6.4.18(JEDEC Basic Flash Parameter Table: 15th DWORD) for more details. */
    do
    {
        bool isQuadMode                 = false;
        run_context_t runContext        = {0x00U, 0x00U};
        uint32_t enter_quad_mode_option = (uint32_t)kSerialNorQuadMode_NotConfig;
        uint32_t lut_seq[4];
        FLEXSPI_NOR_Memset(lut_seq, 0, sizeof(lut_seq));

        /* JESD216 doesn't has 15th DWORD in basic parameters table, which records quad mode enable requirements, it
         * needs to be configured based on its datasheet. */
        if (tbl->standard_version == 0x00U)
        {
            /* GigaDevice(0xC8U)/Winbond(0xEFU)/Adesto(0x1FU), QE is bit 1 of the status register 2. */
            if ((tbl->manufacturerId == 0xC8U) || (tbl->manufacturerId == 0xEFU) || (tbl->manufacturerId == 0x1FU))
            {
                tbl->basic_flash_param_tbl.mode_4_4_info.quad_enable_requirement = 0x04U;
            }
            /* ISSI(0x9DU)/MXIC(0xC2U), QE is bit 6 of status register 1. */
            else if ((tbl->manufacturerId == 0x9DU) || (tbl->manufacturerId == 0xC2U))
            {
                tbl->basic_flash_param_tbl.mode_4_4_info.quad_enable_requirement = 0x02U;
            }
            /* Cypress(0x34U), QE is bit 1 of the status register 2. */
            else if (tbl->manufacturerId == 0x34U)
            {
                tbl->basic_flash_param_tbl.mode_4_4_info.quad_enable_requirement = 0x05U;
            }
            else
            {
                /* TODO*/
            }
        }

        /* JESD216 has 9 DWORDS(size: 36), JESD216A/B has 16 DWORDS(size: 64) AND JESD216/C/D/D-01 has 20 DWORDS(size:
         * 80). */
        if (tbl->basic_flash_param_tbl_size >= 36U)
        {
            config->deviceModeCfgEnable = true;

            /* Set Quad mode read instruction for LUT. */
            switch (tbl->basic_flash_param_tbl.mode_4_4_info.quad_enable_requirement)
            {
                /* QE is bit 1 of status register 2. It is set via Write Status with two data bytes where bit 1 of the
                   second byte is one. It is cleared via Write Status with two data bytes where bit 1 of the second byte
                   is zero. Writing only one byte to the status register has the side-effect of clearing status register
                   2, including the QE bit. The 100b code is used if writing one byte to the status register does not
                   modify status register 2.
                   Based on above information, choose write 1 byte where bit 1 is one to the status register 2 directly.
                 */
                case 1:
                    enter_quad_mode_option = (uint32_t)kSerialNorQuadMode_StatusReg2_Bit1_0x31;
                    lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg2Bit1,
                                                 kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);
                    runContext.lengthInByte = 0x01U;
                    break;
                /* QE is bit 6 of status register 1. It is set via Write Status with one data byte where bit 6 is one.
                   It is cleared via Write Status with one data byte where bit 6 is zero */
                case 2:
                    enter_quad_mode_option = (uint32_t)kSerialNorQuadMode_StatusReg1_Bit6;
                    lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg1,
                                                 kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);
                    runContext.lengthInByte = 0x01U;
                    break;
                /* QE is bit 7 of status register 2. It is set via Write status register 2 instruction 3Eh with one data
                   byte where bit 7 is one. It is cleared via Write status register 2 instruction 3Eh with one data
                   byte where bit 7 is zero. The status register 2 is read using instruction 3Fh */
                case 3:
                    enter_quad_mode_option = (uint32_t)kSerialNorQuadMode_StatusReg2_Bit7;
                    lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg2Bit7,
                                                 kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);
                    runContext.lengthInByte = 0x01U;
                    break;
                /* QE is bit 1 of status register 2. It is set via Write Status with two data bytes where bit 1 of the
                   second byte is one. It is cleared via Write Status with two data bytes where bit 1 of the second
                   byte is zero. In contrast to the 001b code, writing one byte to the status register does not
                   modify status register 2. */
                case 4:
                    enter_quad_mode_option = (uint32_t)kSerialNorQuadMode_StatusReg1AndReg2;
                    lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg2Bit1,
                                                 kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);
                    runContext.lengthInByte = 0x02U;
                    break;
                /* QE is bit 1 of the status register 2. Status register 1 is read using Read Status instruction 05h.
                   Status register 2 is read using instruction 35h. QE is set via Write Status instruction 01h with
                   two data bytes where bit 1 of the second byte is one. It is cleared via Write Status with two
                   data bytes where bit 1 of the second byte is zero. */
                case 5:
                    enter_quad_mode_option = (uint32_t)kSerialNorQuadMode_StatusReg1AndReg2;
                    lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg2Bit1,
                                                 kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);
                    runContext.lengthInByte = 0x02U;
                    break;
                /* QE is bit 1 of the status register 2. Status register 1 is read using Read Status instruction 05h.
                   Status register 2 is read using instruction 35h, and status register 3 is read using instruction
                   15h. QE is set via Write Status Register instruction 31h with one data byte where bit 1 is one.
                   It is cleared via Write Status Register instruction 31h with one data byte where bit 1 is zero */
                case 6:
                    enter_quad_mode_option = (uint32_t)kSerialNorQuadMode_StatusReg2_Bit1_0x31;
                    lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg2Bit1,
                                                 kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);
                    runContext.lengthInByte = 0x01U;
                    break;
                default:
                    enter_quad_mode_option      = (uint32_t)kSerialNorQuadMode_NotConfig;
                    config->deviceModeCfgEnable = false;
                    runContext.lengthInByte     = 0x01U;
                    break;
            }
        }
        else
        {
            enter_quad_mode_option = (uint32_t)config->quadMode;
        }

        if (enter_quad_mode_option != (uint32_t)kSerialNorQuadMode_NotConfig)
        {
            flexspi_transfer_t flashXfer;
            uint32_t statusVal = 0;

            if ((uint32_t)kSerialNorQuadMode_StatusReg1AndReg2 != enter_quad_mode_option)
            {
                flashXfer.deviceAddress = 0;
                flashXfer.port          = config->devicePort;
                flashXfer.cmdType       = kFLEXSPI_Read;
                flashXfer.data          = &statusVal;
                flashXfer.dataSize      = 1;
                flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READSTATUS;
                flashXfer.SeqNumber     = 1;

