datomusic/duo-imxrt/brains2/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
                FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READSTATUS * 4U, lut_seq,
                                  sizeof(lut_seq) / sizeof(lut_seq[0]));

                /* Read status based on new LUT for Quad mode. */
                status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);
                if (status != kStatus_Success)
                {
                    break;
                }
                else
                {
                    /* Update LUT table to read busy status in status register1. */
                    if ((uint32_t)kSerialNorQuadMode_StatusReg1_Bit6 != enter_quad_mode_option)
                    {
                        lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg1,
                                                     kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);
                        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READSTATUS * 4U,
                                          lut_seq, sizeof(lut_seq) / sizeof(lut_seq[0]));
                    }
                }
            }
            else
            {
                uint32_t statusReg1Val = 0x00U;
                uint32_t statusReg2Val = 0x00U;

                /* Read status register1. */
                lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg1,
                                             kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);

                flashXfer.deviceAddress = 0;
                flashXfer.port          = config->devicePort;
                flashXfer.cmdType       = kFLEXSPI_Read;
                flashXfer.data          = &statusReg1Val;
                flashXfer.dataSize      = 1;
                flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READSTATUS;
                flashXfer.SeqNumber     = 1;

                FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READSTATUS * 4U, lut_seq,
                                  sizeof(lut_seq) / sizeof(lut_seq[0]));

                /* Read status based on new LUT for Quad mode. */
                status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

                if (status != kStatus_Success)
                {
                    break;
                }
                else
                {
                    /* Read status register2. */
                    lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg2Bit1,
                                                 kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);

                    flashXfer.deviceAddress = 0;
                    flashXfer.port          = config->devicePort;
                    flashXfer.cmdType       = kFLEXSPI_Read;
                    flashXfer.data          = &statusReg2Val;
                    flashXfer.dataSize      = 1;
                    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READSTATUS;
                    flashXfer.SeqNumber     = 1;

                    FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READSTATUS * 4U,
                                      lut_seq, sizeof(lut_seq) / sizeof(lut_seq[0]));

                    /* Read status based on new LUT for Quad mode. */
                    status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

                    if (status != kStatus_Success)
                    {
                        break;
                    }
                    else
                    {
                        /* Update LUT table to read busy status in status register1. */
                        lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg1,
                                                     kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);
                        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READSTATUS * 4U,
                                          lut_seq, sizeof(lut_seq) / sizeof(lut_seq[0]));
                    }
                }

                statusVal = (statusReg2Val << 8) | statusReg1Val;
            }

            /* Override status value if it is required by user. */
            if (config->statusOverride != 0x00U)
            {
                statusVal = config->statusOverride;
            }

            /* Do modify-afer-read status and then create Quad mode Enable sequence. */
            config->deviceModeCfgEnable = true;

            switch (enter_quad_mode_option)
            {
                case (uint32_t)kSerialNorQuadMode_StatusReg1_Bit6:
                    if ((statusVal & (0x01UL << 6)) == (0x01UL << 6))
                    {
                        isQuadMode = true;
                    }
                    else
                    {
                        statusVal |= (0x01UL << 6);
                    }
                    /* QE is set via Write Status with one data byte where bit 6 is one. */
                    config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4U] =
                        FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_WriteStatusReg1,
                                        kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_1PAD, 0x01);
                    break;
                case (uint32_t)kSerialNorQuadMode_StatusReg1AndReg2:
                    if ((statusVal & (0x01UL << 9)) == (0x01UL << 9))
                    {
                        isQuadMode = true;
                    }
                    else
                    {
                        statusVal |= (0x01UL << 9);
                    }
                    /* QE is set via Write Status instruction 01h with two data bytes where bit 1 of the second byte is
                     * one. */
                    config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4U] =
                        FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_WriteStatusReg1,
                                        kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_1PAD, 0x02);
                    break;
                case (uint32_t)kSerialNorQuadMode_StatusReg2_Bit1_0x31:
                    if ((statusVal & (0x01UL << 1)) == (0x01UL << 1))
                    {
                        isQuadMode = true;
                    }
                    else
                    {
                        statusVal |= (0x01UL << 1);
                    }
                    /* QE is set via Write Status instruction 01h with two data bytes where bit 1 of the second byte is
                     * one. */
                    config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4U] =
                        FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_WriteStatusReg2Bit1,
                                        kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_1PAD, 0x01);
                    break;
                case (uint32_t)kSerialNorQuadMode_StatusReg2_Bit7:
                    if ((statusVal & (0x01UL << 7)) == (0x01UL << 7))
                    {
                        isQuadMode = true;
                    }
                    else
                    {
                        statusVal |= (0x01UL << 7);
                    }
                    /*QE is set via Write status register 2 instruction 3Eh with one data byte where bit 7 is one. */
                    config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4U] =
                        FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_WriteStatusReg2Bit7,
                                        kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_1PAD, 0x01);
                    break;
                default:
                    config->deviceModeCfgEnable = false;
                    break;
            }

            /* Update LUT table. */
            FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4UL,
                              &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITESTATUS], 4);

